# -*- coding: utf-8 -*-
"""
Created on Thu Oct  6 21:54:10 2022

@author: AngelTodorov
"""

print ("Въведи желана годишна печалба (%)")

profit = float(input())

print ("Въведи инвестиционен хоризонт (години)")

horizon = int(input())

print ("Рисков толеранс (консервативен/балансиран/рисков)")

tolerance = str(input())


if profit > 12:
	print ("Избраната печалба е непостижима за нашия фонд, не можем да управляваме твоите средства")
elif profit < 3:
	print ("Отвори си депозит в банка")
else:
	print ("Можем да управляваме твоите средства")

if horizon < 1: 
	print ("Сигурен ли си, че инвестиционният ти хоризонт е по-малко от година? Не управляваме средства за толкова кратък период")
elif horizon > 10:
	print ("Сигурен ли си, че че инвестиционният ти хоризонт е повече от 10 години? За толкова време могат да се променят много неща")
else:
	print ("Можем да управляваме твоите средства")

if tolerance == "консервативен":
	print ("Чудесно, в тази среда е добре да имаш консервативен подход")

elif tolerance == "балансиран":
	print ("Балансираният подход винаги е добра стратегия")

elif tolerance == "рисков":
	print ("Който не рискува, не печели")

else:
	print ("Въвел си грешна стойност")
